Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The application consists of a so-called JobGraph, a logical dataflow graph (see Chapter 2), and a JAR file that bundles all required classes, libraries, and other resources.
zh_cn: 该应用会包含一个所谓的JobGraph，一个逻辑dataflow图（见第2章），还有一个打包了全部所需类、库以及其他资源的JAR文件。

source: The application consists of two source tasks that each consume a stream of increasing numbers.
zh_cn: 应用包含了两个数据源任务，每个任务都会各自消费一条自增数字流。

source: The application has a single source task that consumes a stream of increasing num‐ bers—1, 2, 3, and so on.
zh_cn: 该应用有一个数据源任务，负责从一个递增数字（1、2、3……）流中读取数据。

source: The application in Example 10-3 consists of five operators, two sources, two inter‐ mediate operators, and a sink operator.
zh_cn: 示例10-3中的应用包含了五个算子——两个数据源，两个中间算子和一个数据汇。

source: The application is depicted in Figure 3-19.
zh_cn: 应用细节如图3-19所示。

source: The application logic to read from and write to state is often straightforward.
zh_cn: 应用读写状态的逻辑通常都很简单，

source: The application receives the stream of temperature sensor readings you have seen previously and an additional stream of smoke level measurements.
zh_cn: 该应用会接收一条包含之前所见到的全部温度传感器读数的数据流，以及另外一条烟雾指数测量值数据流。

source: The application requires 10 processing slots.
zh_cn: 应用总共需要10个处理槽。

source: The application we are going to run converts and aggregates randomly generated temperature sensor readings by time.
zh_cn: 该应用会读取随机生成的温度传感器数值，并按时间对它们执行转换和聚合操作。

source: The application will continue running if the savepoint command failed.
zh_cn: 反之如果保存点命令失败，则应用将继续运行。

source: The application will continue to run with the original parallelism if the triggered savepoint failed.
zh_cn: 如果触发生成保存点失败，应用会以原并行度继续运行。

source: The application will replay (and fast for‐ ward) the input events from the event log until it reaches the tail of the stream.
zh_cn: 随后应用会从事件日志中读取并（快速）重放输入事件，直到追赶上数据流当前的进度。

source: The applications are usually connected to external services or face human users and continuously process incoming events such as orders, or mails, or clicks on a website.
zh_cn: 此类应用通常会连接外部服务或真人用户，并持续处理诸如订单、邮件、网站点击等传入的数据。

source: The applications in Figure 1-5 are connected by event logs.
zh_cn: 图1-5中不同应用之间通过事件日志进行连接，

source: The applications in our example architecture are connected by event logs.
zh_cn: 示例架构中的应用通过事件日志进行连接，

source: The application’s restart strategy determines how often the JobManager restarts the application and how long it waits between restart attempts.1
zh_cn: 应用的重启策略决定了JobManager以何种频率重启应用以及重启尝试之间的等待间隔。1

source: The application’s restart strategy2 determines how often the JobManager tries to restart the application and how long it waits between restart attempts.
zh_cn: 应用的重启策略决定了JobManager以何种频率尝试重启应用以及重启尝试之间的等待间隔。

source: The architecture is depicted in Figure 1-3.
zh_cn: 图1-3详细描绘了其架构。

source: The arguments of the StreamExecutionEnvironment.readFile() method are:
zh_cn: StreamExecutionEnvironment.readFile()方法的参数包括：

source: The asQueryableState() method appends a queryable state sink to the stream.
zh_cn: asQueryableState()方法会在数据流后面添加一个可查询式状态的数据汇。

source: The assignTimestampsAndWater marks(new SensorTimeAssigner) method assigns the timestamps and watermarks that are required for event time.
zh_cn: assignTimestampsAndWatermarks(new SensorTimeAssigner)方法负责分配事件时间所需的时间戳和水位线。

source: The assigner determines to which windows the element needs to be routed.
zh_cn: 该分配器决定了元素应该被路由至哪（几）个窗口中。

source: The asyncInvoke() method is called for each input record with two parameters.
zh_cn: 对于每个输入记录我们都会使用两个参数去调用asyncInvoke()方法。

source: The asyncInvoke() method of DerbyAsyncFunction in Example 8-17 wraps the blocking JDBC query in a Future, which is executed via CachedThreadPool.
zh_cn: 示例8-17中DerbyAsyncFunction的asyncInvoke()方法将阻塞式的JDBC查询包在Future对象中，后者会通过CachedThreadPool来执行。

source: The asynchronous operator that applies an AsyncFunction is configured with the AsyncDataStream object,10 which provides two static methods: orderedWait() and unorderedWait().
zh_cn: 接收AsyncFunction的异步算子可以通过AsynDataStream对象来配置，10 它提供了两个静态方法：orderedWait()和unorderedWait()。

source: The batch processor periodically processes the data in batch storage, writes the exact results into a batch table, and drops the corre‐ sponding inaccurate results from the speed table.
zh_cn: 批处理引擎周期性地处理批量存储的数据，将精确结果写入批处理表，随后将"提速表"中对应的非精确结果删除。

source: The blob.storage.directory key configures the local storage directory of the blob server, which is used to exchange larger files such as the application JAR files.
zh_cn: blob.storage.directory参数项用于配置Blob服务器的本地存储目录，该目录常用于大文件（例如应用JAR包）交换。

source: The blue and green slot-sharing groups require four slots each due to the maximum parallelism of their assigned operators.
zh_cn: blue和green处理槽共享组由于其所含算子的最大并行度为4，因此分别需要4个处理槽。

source: The book examples are provided as a Maven project.
zh_cn: 书中的示例都是以Maven项目的形式出现。

source: The boolean condition is implemented as a function either using the FilterFunction interface or a lambda function.
zh_cn: 可以利用FilterFunction接口或Lambda函数来实现定义布尔条件的函数。

source: The boundaries of session windows are defined by gaps of inactivity, time intervals in which no record is received.
zh_cn: 会话窗口的边界由非活动间隔，即没有收到记录的时间间隔来定义。

source: The broadcast state is discussed in detail in “Using Connected Broadcast State” on page 160.
zh_cn: 我们会在第160页"使用联结的广播状态"一节详细讨论该功能。

source: The broadcast() method replicates the input data stream so that all events are sent to all parallel tasks of the downstream operator.
zh_cn: broadcast()方法会将输入流中的事件复制并发往所有下游算子的并行任务。

source: The bucket is chosen by a BucketAssigner, which is a public interface and returns for every record a BucketId that determines the directory to which the record will be written.
zh_cn: 桶的选择由BucketAssigner完成，它是一个公开接口，可以为每条记录返回一个用来决定记录写入目录的BucketId。

source: The build script creates and registers a new Docker image that is based on a Java Alpine image, a minimal base image that provides Java.
zh_cn: 该构建脚本会基于一个提供Java的最小基本镜像Java Alpine，来创建并注册一个新的Docker镜像。

source: The build script for the provided image is a good starting point for a custom image.
zh_cn: 我们提供的镜像构建脚本对你构建自定义镜像是一个很好的参考。

source: The build scripts of the available Docker Flink images are a good starting point for customized images.
zh_cn: 已有Flink Docker镜像中的构建脚本可以在一定程度上帮助你快速上手。

source: The business logic is constrained by how much it can control state and time.
zh_cn: 其业务逻辑受制于系统对状态和时间的把控能力。

source: The cancel() method is invoked by Flink when the application is canceled and shut down.
zh_cn: Flink会在应用被取消或关闭时调用cancel()方法。

source: The cashier receives your payment and passes your order to the barista who prepares your beverage.
zh_cn: 收银员收到你的付款后会把订单交给帮你准备饮品的咖啡师。

source: The central class in Flink’s type system is TypeInformation.
zh_cn: Flink类型系统的核心类是TypeInformation，

source: The certificate acts as a shared secret and can be embedded into containers or attached to a YARN setup.
zh_cn: 证书的作用相当于密钥，可以嵌入到容器里或附加到YARN的设置上。

source: The challenges of end-to-end exactly-once applications and approaches to address them are dis‐ cussed in detail in “Application Consistency Guarantees” on page 184.
zh_cn: 有关端到端精确一次应用所面临的挑战和解决方案会在184页"应用一致性保障"一节详细讨论。

source: The checkpoint barriers are notifications to start a new transaction, the notifications of all operators about the success of their individual checkpoint are their commit votes, and the messages of the JobManager that notify about the success of a checkpoint are the instructions to commit the transactions.
zh_cn: 检查点分隔符可认为是开启新事务的通知，所有算子完成各自检查点的通知可看做是提交投票（commit vote），而来自JobManager的检查点创建成功的消息其实是提交事务的指令。

source: The checkpoint barriers emitted by the source tasks are shipped to the connected tasks.
zh_cn: 数据源任务发出的检查点分隔符会传输到与之相连的任务。

source: The checkpoint is complete when all tasks have finished their copies.
zh_cn: 在所有任务完成自己的拷贝工作后，检查点生成完毕。

source: The checkpointing interval is an important parameter that affects the overhead of the checkpointing mechanism during regular processing and the time it takes to recover from a failure.
zh_cn: 检查点间隔是影响常规处理期间检查点机制的开销以及故障恢复所需时间的一个重要参数。

source: The choice also affects the performance of a function because each state backend provides its own implementations for these primitives.
zh_cn: 同时，由于每个状态后端都为这些原语提供了自己的实现，该选择还会影响函数的性能。

source: The choice of the right state primitive depends on how the function interacts with the state.
zh_cn: 它的选择取决于函数同状态的交互方式。

source: The choice of the state backend has implications on the robust‐ ness and performance of a stateful application.
zh_cn: 状态后端的选择会影响状态化应用的鲁棒性及性能。

source: The classpath of the Hadoop dependencies must be declared
zh_cn: Hadoop依赖的Classpath需要在HADOOP_CLASSPATH环境变量中声明。

source: The classpath option of the hadoop command prints its configured classpath.
zh_cn: hadoop命令的classpath选项会打印出它所配置的Classpath。

source: The clean-up time is computed by adding one hour to the timestamp of the current record.
zh_cn: 清理时间被设置为比当前记录时间晚一小时。

source: The client prints a list of all running jobs, including their JobIDs, when you run the following command:
zh_cn: 你可以使用以下命令控制客户端打印出所有正在运行作业（包括其JobID）的列表：

source: The client will try to start the static main() method of the my.app.MainClass class.
zh_cn: 客户端将尝试启动my.app.MainClass类的静态main()方法。

source: The close() method is a finalization method for the function and it is called once per task after the last call of the transformation method.
zh_cn: close()作为函数的终止方法，会在每个任务的转换方法调用结束后调用一次。

source: The code examples of the book use Maven build manage‐ ment.
zh_cn: 书中示例代码都是使用Maven来进行构建管理。

source: The code examples of this book are hosted on GitHub.
zh_cn: 书中的示例代码托管在GitHub上。

source: The code in Example 10-1 results in three tasks—a chained task for Filter1 and Map1, an individual task for Map2, and a task for Filter2, which is not allowed to be chained to Map2.
zh_cn: 示例10-1中的代码会生成三个任务——一个Filter1和Map1的链接任务，一个针对Map2单独任务以及一个Filter2的任务（不允许和Map2进行链接）。

source: The code in Example 10-6 shows the implementation of the WatermarkGauge metric,
zh_cn: 示例10-6中的代码展示了如何实现WatermarkGauge指标，它会对外提供当前的水位线。

source: The code in Example 6-15 creates a cus‐ tom assigner for 30-second tumbling event-time windows.
zh_cn: 示例6-15中的代码为每30秒的滚动事件时间窗口创建了一个自定义分配器。

source: The code in Example 6-2 shows how to use a timestamp assigner.
zh_cn: 示例6-2中的代码展示了时间戳分配器的使用方法。

source: The code in Examples 6-13 and 6-14 shows how to solve the same use case as the code in Example 6-12 with a combination of a ReduceFunction and a Pro cessWindowFunction, emitting every 5 seconds the minimun and maximum temper‐
zh_cn: 示例6-13和6-14中的代码展示了如何使用ReduceFunction和ProcessWindowFunction的组合来应对与示例6-12中相同的用例——

source: The combination of Flink’s checkpointing and recovery mechanism and resettable source connectors guarantees that an application will not lose any data.
zh_cn: Flink的检查点和恢复机制结合可重置的数据源连接器能够确保应用不会丢失数据。

source: The combination of time-based computations as discussed in Chapter 6 and scalable state management empowers developers to realize sophisticated streaming applications.
zh_cn: 开发人员利用我们在第6章介绍的基于时间的计算以及可伸缩的状态管理，能够实现复杂的流式应用。

source: The command returns some basic information about the cluster, such as the Flink version, the number of TaskManagers, slots, and jobs that are running, finished, can‐ celled, or failed:
zh_cn: 该命令会返回集群的一些基本信息（例如：Flink版本，TaskManager和处理槽的数量，以及当前正在运行、已完成、已取消或已失败的作业）：

source: The command triggers a savepoint for the job with the provided JobID.
zh_cn: 该命令会触发JobID所指定的作业生成一个保存点。

source: The command-line client is a tool used to submit and control applications.
zh_cn: 一个用于提交和控制应用的命令行客户端工具。

source: The command-line client is based on a bash script.
zh_cn: 以上命令行客户端是基于Bash脚本完成的，

source: The completed build is located in the ./build-target folder.
zh_cn: 完整的构建结果将位于./build-target文件夹中。

source: The completed checkpoint can be used to recover the appli‐ cation from a failure as described before.
zh_cn: 如前所述，应用在发生故障时就可以利用这个生成好的检查点进行恢复。

source: The configuration can be defined per URI scheme.
zh_cn: 该配置支持为每个URI协议单独定义，

source: The configuration file is read by dif‐ ferent components, such as the start scripts, the master and worker JVM processes, and the CLI client.
zh_cn: 会供不同组件（如启动脚本、主进程和工作进程以及CLI客户端）读取使用。

source: The configuration key taskmanager.memory.segment-size determines the size of a network buffer, which is 32 KB by default.
zh_cn: 配置项taskmanager.memory.segment-size决定了网络缓冲区的大小，其默认值是32KB。

source: The configuration keys contain constant strings, such as “taskmanager,” and variables shown in angle brackets.
zh_cn: 配置键由常量字符串（例如"taskmanager"）和尖括号中的变量组成。

source: The configuration of the application
zh_cn: 应用的配置

source: The connect transformation and the cofunctions discussed in this section are more generic.
zh_cn: 本节讨论的connect转换以及协处理函数（cofunction）通用性更强。

source: The connector is fully self-contained and does not expose any dependencies.
zh_cn: 该连接器同样可以独立工作，没有暴露任何对外的依赖。

source: The connec‐ tion limits can be configured either separately for input and output connections or as the total number of connections.
zh_cn: 你既可以为输入和输出单独限制连接数，也可以对总的连接数加以限制。

source: The consistency guarantees that Flink’s Kafka sink provides depend on its configura‐ tion.
zh_cn: Flink kafka数据汇所提供的一致性保障取决于它的配置。

source: The constructed plan is translated into a JobGraph and submitted to a JobManager for execution.
zh_cn: 构建完的计划会被转成JobGraph并提交至JobManager执行。

source: The constructor of TwoPhaseCommitSinkFunction requires two TypeSerializer— one for the TXN type and the other for the CONTEXT type.
zh_cn: TwoPhaseCommitSinkFunction的构造函数需要传入两个TypeSerializer，一个用于TXN类型，另一个用于CONTEXT类型。

source: The constructor takes three arguments.
zh_cn: 构造方法需要三个参数。

source: The constructor used in Example 8-2 receives three parameters.
zh_cn: 示例8-2中的构造方法接收三个参数。

source: The containers work together like a stand‐ alone deployment (see “Standalone Cluster”).
zh_cn: 这些容器的工作原理和独立集群部署（请参阅"独立集群"）类似。

source: The content of the window is completely discarded and the window including all metadata is removed.
zh_cn: 完全清除窗口内容，并删除窗口自身及其元数据。

source: The corre‐ sponding FlatMapFunction defines the flatMap() method, which may return zero, one, or more events as results by passing them to the Collector object:
zh_cn: 对应的FlatMapFunction定义了flatMap()方法，你可以在其中通过向Collector对象传递数据的方式返回零个、一个或多个事件作为结果：

source: The curl command to start an application with a default parallelism of 4 is:
zh_cn: 以下curl命令可以启动应用并将默认并行度设置为4：

source: The curl command to trigger a savepoint without canceling is:
zh_cn: 仅生成保存点而不取消应用的curl命令是：

source: The curl command to upload a JAR file:
zh_cn: 用于上传JAR文件的curl命令：

source: The data that is stored in the various transactional database systems of a company can provide valuable insights about a company’s business operations.
zh_cn: 存储于不同事务型数据库系统中的数据，可以为公司提供业务运营相关的分析见解。

source: The data that is stored in the various transactional database systems of a company can provide valuable insights about various aspects of the company’s business.
zh_cn: 存储于公司多个事务型数据库系统中的数据，可以为公司业务提供各个方面的宝贵见解。

source: The data type must be specified because
zh_cn: 由于Flink需要为状态创建合适的序列化器，因此数据类型指定是强制的。

source: The data types handled by the state are specified as Class or TypeInformation objects (see “Types” on page 97 for a discussion of Flink’s type handling).
zh_cn: 状态处理的数据类型可以通过Class或TypeInformation对象指定（有关Flink类型处理的讨论请参见第97页的"类型"一节）。

source: The data written to the batch storage is periodically processed by a batch processor.
zh_cn: 而批处理引擎会定期处理数据并将结果写入批量存储。

source: The default configuration of a Kafka cluster can still lead to data loss, even after a write is acknowledged.
zh_cn: 即使已经确认数据写入成功，Kafka集群如果采用默认配置，则仍可能丢失数据。

source: The default constructor is required by Flink as mentioned in “Supported Data Types” on page 98 when discussing supported data types.
zh_cn: 此外，正如第98页"支持的数据类型"一节中所介绍的，Flink还需要POJO有一个默认构造方法。

source: The default is one slot per TaskMan‐ ager.
zh_cn: 它的默认值是每个TaskManager一个处理槽。

source: The default maximum parallelism of an operator depends on the operator’s parallel‐ ism in the application’s first version:
zh_cn: 算子的默认最大并行度会取决于应用首个版本中算子的并行度：

source: The default parallelism can be specified when starting an application (e.g., using the -p parameter in the CLI client).
zh_cn: 该默认并行度可以在启动应用时指定（例如在CLI客户端中使用-p参数）。

source: The default parallelism of an execution environment is overwritten by all settings explicitly specified by the source code of the application—the parallelism that is
zh_cn: 执行环境的默认并行度可以被代码中显式设置的并行度所覆盖，

source: The default parallelism of an operator can be overridden by specifying it explicitly.
zh_cn: 可以通过显式指定来覆盖算子的默认并行度。

source: The default restart strategy used if no restart strategy is explicitly defined is a fixed- delay restart strategy with Integer.MAX_VALUE restart attempts and a 10-second delay.
zh_cn: 如果没有显式指定重启策略，默认的策略是以10秒延迟尝试Integer.MAX_VALUE次的固定延迟重启策略。

source: The default scheduling behavior was explained in Chapter 3.
zh_cn: 第3章介绍了默认的调度行为。

source: The default state backend of an application is MemoryStateBackend.
zh_cn: 应用默认的状态后端是MemoryStateBackend。

source: The dependency for Flink’s universal Kafka connector is added to a Maven project as shown in the following:
zh_cn: 我们可以像下面这样把Flink通用的Kafka连接器依赖添加到Maven项目中：

source: The dependency for the universal Flink Kafka connector is added to a Maven project as shown in the following:
zh_cn: 我们可以像下面这样把Flink通用的Kafka连接器依赖添加到Maven项目中：

source: The descriptors for ReducingState and AggregatingState also need a ReduceFunction or AggregateFunction object to aggregate the added
zh_cn: ReducingState和AggregatingState的描述符还需要接收一个ReduceFunction或AggregateFunction对象，以此来对加入的值进行聚合。

source: The different state backends can be created with minimum settings as shown in the following.
zh_cn: 你可以像下面这样以最少的设置创建不同的状态后端。

source: The directory also contains a YAML file job- cluster-service.yaml that defines a Kubernetes service.
zh_cn: 该目录中还包含了一个YAML文件job-cluster-service.yaml，可用于定义Kubernetes的Service。

source: The directory contains two template files:
zh_cn: 该目录包含了两个模板文件：

source: The dis‐ patcher also runs a web dashboard to provide information about job executions.
zh_cn: Dispatcher同时还会启动一个web仪表盘，用来提供有关作业执行的信息。

source: The dispatcher also runs a web dashboard to provide information about job executions.
zh_cn: Dispatcher同时还会启动一个Web UI，用来提供有关作业执行的信息。

source: The documentation also includes how-tos and tips for different environments, such as standalone clusters, Kubernetes, and YARN.
zh_cn: 文档中还包含了针对不同环境（例如独立集群、Kubernetes和YARN）的方法和小窍门。

source: The earliest offset of each individual partition:
zh_cn: 每个分区最早的偏移：

source: The easiest way to handle late events is to simply discard them.
zh_cn: 处理迟到事件最简单的方式就是直接将其丢弃，

source: The embedded execution mode starts an application and the whole Flink system in a single JVM process, which can be used to run and debug Flink jobs within an IDE.
zh_cn: Flink的嵌入式执行模式可将应用自身连同整个Flink系统在单个JVM进程内启动，方便从IDE里运行和调试Flink作业。

source: The end timestamp of GlobalWindows is Long.MAX_VALUE.
zh_cn: GlobalWindows的结束时间戳是Long.MAX_VALUE，

source: The end-to- end consistency of the application depends on the integration of the chosen stream sinks with Flink’s checkpointing algorithm.
zh_cn: 该一致性取决于所选数据汇和Flink检查点算法的组合情况。

source: The env.log.dir key configures the directory into which a TaskManager writes its log files (by default, the ./log directory in the Flink setup).
zh_cn: env.log.dir参数用于配置TaskManager的日志文件目录（默认值是Flink安装位置的./log目录）。

source: The event log decouples senders and receivers and provides asynchronous, non-blocking event transfer.
zh_cn: 事件日志将发送端和接收端解耦，并提供异步非阻塞的事件传输机制。

source: The event log decouples senders and receivers and provides asynchro‐ nous, nonblocking event transfer.
zh_cn: 事件日志将发送端和接收端解耦，并提供异步非阻塞的事件传输机制。

source: The event log pub‐ lishes the changes to consumers that incorporate the updates into the affected data stores.
zh_cn: 事件日志系统将改动发布给消费者，再由消费者将更新整合到相关数据存储系统中。

source: The event-time clocks of a task with two input streams will corre‐ spond to the watermarks of the slower stream and usually the records or intermediate results of the faster stream are buffered in state until the event-time clock allows pro‐ cessing them.
zh_cn: 对于一个有两个输入流的任务而言，其事件时间时钟会受制于那个相对较慢的流，而较快流的记录或中间结果会在状态中缓冲，直到事件时间时钟到达允许处理它们的那个点。

source: The events are merged in a FIFO fashion—the operator does not produce a specific order of events.
zh_cn: union执行过程中，事件会以FIFO的方式合并，其顺序无法得到任何保证。

source: The events of the nonbroadcasted stream are simply forwarded.
zh_cn: 而所有非广播流的事件只是会被简单地转发。

source: The evictBefore() and evictAfter() methods are called before and after a window function is applied on the content of a window, respectively.
zh_cn: evictBefore()和evictAfter()方法分别会在窗口函数作用于窗口内容之前和之后调用。

source: The evictor is an optional component that can be injected before or after a Process WindowFunction is called.
zh_cn: 移除器作为一个可选组件，允许在ProcessWindowFunction调用之前或之后注入。

source: The exact results are written into a batch table and the corresponding inaccurate results from the speed table are dropped.
zh_cn: 在精确结果写入批处理表后，"提速表"中对应的非精确结果就可以删除。

source: The examples repository contains an application that fails and recovers in regular intervals to demonstrate the behavior of StdOutWriteAheadSink and a regular Data Stream.print() sink in case of failures.
zh_cn: 示例仓库中还包含了一个应用，它会周期性地发生故障并执行恢复，我们以此来展示StdOutWriteAheadSink和常规的DataStream.print()数据汇在故障时的行为。

source: The exception that caused an application to fail
zh_cn: 导致应用失败的异常信息

source: The execu‐ tion of tasks and the concept of slots is discussed in more detail in a later section.
zh_cn: 我们将在随后一节更详细讨论任务执行和处理槽的概念。

source: The execution environment determines whether the program is running on a local machine or on a cluster.
zh_cn: 执行环境决定了应用是在本地机器上还是集群上运行。

source: The execu‐ tion of tasks and the concept of slots is discussed in “Task Execution”.
zh_cn: 我们将在"任务执行"一节进一步讨论任务执行和处理槽的概念。

source: The expressiveness of the API and the quality of state handling and event-time support determine the business logic that can be implemented and exe‐ cuted.
zh_cn: API的表达能力以及对状态处理和事件时间的支持水平等诸多因素决定了可以实现和执行的业务逻辑。

source: The external identifier that is passed with the setQueryable() method can be freely chosen and is only used to configure the queryable state client.
zh_cn: 传递给setQueryable()方法的外部标识符可以随意选择，它们只会在可查询式状态客户端的配置中用到。

source: The external sink system must provide transactional support or the sink must be able to emulate transactions on the external system.
zh_cn: 外部数据汇系统必须支持事务，否则就要在数据汇上模拟外部系统的事务。

source: The external system supports updates per key, such as a relational database sys‐ tem or a key-value store.
zh_cn: 外部系统支持按照键值更新，例如关系型数据库或键值存储。

source: The extracted directory includes a ./bin folder with bash scripts1 to start and stop Flink processes.
zh_cn: 解压后的目录包含了一个./bin文件夹，里面包含了用于启动和停止Flink进程的bash脚本 1。

source: The extracted timestamps are assigned to the respective record and the queried watermarks are ingested into the stream.
zh_cn: 提取出来的时间戳会附加到各自的记录上，查询得到的水位线会注入到数据流中。

source: The failure rate is specified as the maximum number of failures within a time interval.
zh_cn: 故障率被定义为某个时间间隔内的最大故障数。

source: The failure-rate restart strategy restarts an application as long as a configurable failure rate is not exceeded.
zh_cn: failure-rate重启策略允许在未超过故障率的前提下不断重启应用。

source: The fields are mapped to the parameters based on their position; the first value is converted to the first parameter and so on.
zh_cn: 字段到参数的映射是按照位置进行的，即第一个值转换为第一个参数，以此类推。

source: The figure shows four sender and four receiver tasks.
zh_cn: 其中包含了4个发送端和4个接收端任务。

source: The files are also provided in our repository.
zh_cn: 所有这些文件同样可以从我们的代码库中找到。

source: The filesystem source is part of the flink-streaming-java module.
zh_cn: 该文件系统数据源是flink-streaming-java模块的一部分，
